_posts/2022-05-15-installing-the-latest-manjaro-dev-on-pine-phone.html
---
layout: post
title: Installing the latest Manjaro dev on the PinePhone (for dummies)
tags: [pinephone, manjar, installing, tutorial]
---
<link rel="stylesheet" type="text/css" href="/assets/main.css" />
<link rel="stylesheet" type="text/css" href="/_orgcss/site.css" />
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc2d12db">About</a>
<ul>
<li><a href="#org23e2079">"Wait &#x2013; Manjaro? PinePhone?" - Prerequisites.</a></li>
</ul>
</li>
<li><a href="#org24c5003">Manjaro</a>
<ul>
<li><a href="#org2470046">Where does the PinePhone Manjaro live?</a></li>
</ul>
</li>
<li><a href="#org6590d15">How do I make it go?</a></li>
<li><a href="#orgce75734">Sync &amp; Eject</a></li>
<li><a href="#org7437f1a">Plug it in</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc2d12db" class="outline-2">
<h2 id="orgc2d12db">About</h2>
<div class="outline-text-2" id="text-orgc2d12db">
<p>
I don't think of you nor myself as a dummy, but sometimes it's just been <b>too</b> long and you really wish you had a <b>small</b> post to knock the rust off of an old workflow.
</p>
</div>
<div id="outline-container-org23e2079" class="outline-3">
<h3 id="org23e2079">"Wait &#x2013; Manjaro? PinePhone?" - Prerequisites.</h3>
<div class="outline-text-3" id="text-org23e2079">
<p>
I won't be discussing what a Linux distro is, or Manjaro itself, nor bikeshedding on what distro you should put on your <a href="https://www.pine64.org/pinephone/">PinePhone</a>.
</p>

<p>
This blog'll be a bit higher-speed than usual.
</p>
</div>
</div>
</div>

<div id="outline-container-org24c5003" class="outline-2">
<h2 id="org24c5003"><a href="https://manjaro.org/">Manjaro</a></h2>
<div class="outline-text-2" id="text-org24c5003">
</div>
<div id="outline-container-org2470046" class="outline-3">
<h3 id="org2470046">Where does the PinePhone Manjaro live?</h3>
<div class="outline-text-3" id="text-org2470046">
<p>
It's really hard to tell what's the official, but coming from <a href="https://www.pine64.org/2020/08/31/pinephone-manjaro-community-edition/">the PinePhone Manjaro Edition blog post</a>, I would say that it lives here:
</p>

<ul class="org-ul">
<li><a href="https://osdn.net/projects/manjaro-arm/storage/pinephone/">https://osdn.net/projects/manjaro-arm/storage/pinephone/</a></li>
</ul>

<p>
Odd link. Who dat?
</p>

<p>
Anyway, that repo is <b>tragically</b> out of date in the cyber-future of 2022.
Let me show you where it really lives: <a href="https://github.com/manjaro-pinephone/">here</a>, for example <a href="https://github.com/manjaro-pinephone/plasma-mobile-dev">here</a>, and for right now <a href="https://github.com/manjaro-pinephone/plasma-mobile-dev/releases/">literally right here</a>.
</p>

<p>
Line noise to read, but CTRL+F for <code>-pinephone-</code> or <code>-pinephonepro-</code> depending on your case and grab the one ending in <code>`xz`</code>.
</p>

<p>
Grab the <code>`.sha1`</code> only if you're feeling (<code>`sha1sum -c blablah.sha1`</code>) fancy, and the <code>pkgs.txt</code> is just for human eyeballs and interest, it seems. Skip.
</p>
</div>
</div>
</div>
<div id="outline-container-org6590d15" class="outline-2">
<h2 id="org6590d15">How do I make it go?</h2>
<div class="outline-text-2" id="text-org6590d15">
<p>
To be slow and boring, read the <a href="https://wiki.pine64.org/index.php/PinePhone_Installation_Instructions#Installation_to_the_eMMC">wiki</a>.
</p>

<p>
For fast action:
</p>

<ol class="org-ol">
<li>Stick a micro SD card in to your laptop where you have the <code>.xz</code> (bigger is better, faster is best)</li>
<li>Check <code>`fdisk -l | grep '^Disk \/'`</code> for your microSD card</li>
<li>Prepare for imminent destruction of all data on the disk</li>
<li><code>`xzcat Manjaro-ARM-plasma-mobile-dev-pinephone-20220515.img.xz | sudo dd of=/dev/YOUR_SDCARD_PLZ bs=1M`</code></li>
</ol>

<p>
If it's a <code>gzip</code>, you can swap for <code>`zcat`</code>, but these are usually <code>xz</code> for Manjaro.
</p>

<p>
That's about it.
</p>
</div>
</div>

<div id="outline-container-orgce75734" class="outline-2">
<h2 id="orgce75734">Sync &amp; Eject</h2>
<div class="outline-text-2" id="text-orgce75734">
<p>
Let's be extra nice to the brand new formatted card.
</p>

<pre class="example">
$ sudo sync
$ sudo eject /dev/YOUR_SDCARD_PLZ
</pre>

<p>
The sync may take a while and &#x2013; heck, I believe it's fully redundant to the call to eject, but isn't it nice to be extra safe?
</p>
</div>
</div>

<div id="outline-container-org7437f1a" class="outline-2">
<h2 id="org7437f1a">Plug it in</h2>
<div class="outline-text-2" id="text-org7437f1a">
<p>
Pop that back cover (be careful of the screen) and slip out the battery.
In goes the new SD Card.
</p>

<p>
Cover back on &#x2013; oh, what am I saying! You know what to do: POWER ON!
</p>

<p>
The first device selected is the SD Card so there's no more steps.
My device showed the logo within about 15s of power on, then took quite about 5+ minutes to set up the whole shenanigan.
</p>

<p>
The user experience needs a bit of work there, as the spinning logo <b>did</b> freeze up and it went to a black-screen for about 2m before finally being ready.
</p>

<p>
Enjoy!
</p>
</div>
</div>
